
## Plan Result

[CI link](https://github.com/armchair-philosophy/t98s-minecraft-server/actions/runs/2287869834)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.minecraft-starter-http
  * google_cloudfunctions_function.minecraft-starter-pubsub
* Replace
  * google_service_account_iam_binding.github-actions-apply
  * google_storage_bucket_object.gcf-minecraft-starter_zip


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.minecraft-starter-http will be updated in-place
  ~ resource "google_cloudfunctions_function" "minecraft-starter-http" {
        id                            = "projects/t98s-mc-testbed/locations/asia-northeast1/functions/minecraft-starter-http"
        name                          = "minecraft-starter-http"
      ~ source_archive_object         = "gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip"
        # (18 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.minecraft-starter-pubsub will be updated in-place
  ~ resource "google_cloudfunctions_function" "minecraft-starter-pubsub" {
        id                            = "projects/t98s-mc-testbed/locations/asia-northeast1/functions/minecraft-starter-pubsub"
        name                          = "minecraft-starter-pubsub"
      ~ source_archive_object         = "gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_service_account_iam_binding.github-actions-apply must be replaced
-/+ resource "google_service_account_iam_binding" "github-actions-apply" {
      ~ etag               = "BwXebnR6Kkw=" -> (known after apply)
      ~ id                 = "projects/t98s-mc-testbed/serviceAccounts/github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/branch restriction//request.auth.claims.assertion.ref == \"refs/heads/main\"" -> (known after apply)
        # (3 unchanged attributes hidden)

      - condition { # forces replacement
          - expression = "request.auth.claims.assertion.ref == \"refs/heads/main\"" -> null # forces replacement
          - title      = "branch restriction" -> null # forces replacement
        }
    }

  # google_storage_bucket_object.gcf-minecraft-starter_zip must be replaced
-/+ resource "google_storage_bucket_object" "gcf-minecraft-starter_zip" {
      - cache_control       = "" -> null
      - content_disposition = "" -> null
      - content_encoding    = "" -> null
      - content_language    = "" -> null
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "0ER4Ow==" -> (known after apply)
      ~ detect_md5hash      = "pfQtJYBBYTNF08KNunpAVg==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "t98s-gcf-src-rsynbu08-gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> (known after apply)
      ~ kms_key_name        = "" -> (known after apply)
      ~ md5hash             = "pfQtJYBBYTNF08KNunpAVg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/t98s-gcf-src-rsynbu08/o/gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip?generation=1651867325714117&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip" # forces replacement
      ~ output_name         = "gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/t98s-gcf-src-rsynbu08/o/gcf-minecraft-starter_a5f42d258041613345d3c28dba7a4056.zip" -> (known after apply)
      ~ source              = "gcf-minecraft-starter/dist/gcf-minecraft-starter.zip" -> "gcf-minecraft-starter_856c175950335543a841cc40488c430b.zip" # forces replacement
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_project_iam_member.github-actions-apply["roles/cloudfunctions.admin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/cloudfunctions.admin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/compute.admin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/compute.admin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/iam.roleAdmin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/iam.roleAdmin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/iam.securityAdmin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/iam.securityAdmin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/iam.serviceAccountAdmin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/iam.serviceAccountAdmin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/iam.serviceAccountUser"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/iam.serviceAccountUser/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/iap.admin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/iap.admin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/servicemanagement.quotaAdmin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/servicemanagement.quotaAdmin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-apply["roles/storage.admin"] has changed
  ~ resource "google_project_iam_member" "github-actions-apply" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/storage.admin/serviceAccount:github-actions-apply@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.github-actions-plan["roles/viewer"] has changed
  ~ resource "google_project_iam_member" "github-actions-plan" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/viewer/serviceAccount:github-actions-plan@t98s-mc-testbed.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.instanceLister has changed
  ~ resource "google_project_iam_member" "instanceLister" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/projects/t98s-mc-testbed/roles/instanceLister/group:t98s-micraft-admins@googlegroups.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.projectBrowsers has changed
  ~ resource "google_project_iam_member" "projectBrowsers" {
      ~ etag    = "BwXecSWSZxc=" -> "BwXeciztpig="
        id      = "t98s-mc-testbed/roles/viewer/group:t98s-micraft-admins@googlegroups.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"6479beb63128a05d5b960efa218d1f1f037aade9","Vars":{},"WorkflowName":"terraform plan"} -->